openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_can.c
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32v205_can.c
* Author             : WCH
* Version            : V1.0.1
* Date               : 2025/12/18
* Description        : This file provides all the CAN firmware functions.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32v205_can.h"
#include "ch32v205_rcc.h"

/* CAN CTLR Register bits */
#define CTLR_DBF                     ((uint32_t)0x00010000) 

/* CAN Mailbox Transmit Request */
#define TMIDxR_TXRQ                  ((uint32_t)0x00000001) 

/* CAN FCTLR Register bits */
#define FCTLR_FINIT         ((uint32_t)0x00000001)

/* Time out for INAK bit */
#define INAK_TIMEOUT                 ((uint32_t)0x0000FFFF)
/* Time out for SLAK bit */
#define SLAK_TIMEOUT                 ((uint32_t)0x0000FFFF)

/* Flags in TSTATR register */
#define CAN_FLAGS_TSTATR    		 ((uint32_t)0x08000000)
/* Flags in RFIFO1 register */
#define CAN_FLAGS_RFIFO1    	     ((uint32_t)0x04000000)
/* Flags in RFIFO0 register */
#define CAN_FLAGS_RFIFO0             ((uint32_t)0x02000000) 
/* Flags in STATR register */
#define CAN_FLAGS_STATR              ((uint32_t)0x01000000) 
/* Flags in ERRSR register */
#define CAN_FLAGS_ERRSR              ((uint32_t)0x00F00000) 

/* Mailboxes definition */
#define CAN_TXMAILBOX_0              ((uint8_t)0x00)
#define CAN_TXMAILBOX_1              ((uint8_t)0x01)
#define CAN_TXMAILBOX_2              ((uint8_t)0x02) 

#define CAN_MODE_MASK                ((uint32_t) 0x00000003)

static ITStatus CheckITStatus(uint32_t CAN_Reg, uint32_t It_Bit);


/*********************************************************************
 * @fn      CAN_DeInit
 *
 * @brief   Deinitializes the CAN peripheral registers to their default reset
 *        values.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *
 * @return  none
 */
void CAN_DeInit(CAN_TypeDef* CANx)
{
	if (CANx == CAN1)
	{
	    RCC_PB1PeriphResetCmd(RCC_PB1Periph_CAN1,ENABLE);
	    RCC_PB1PeriphResetCmd(RCC_PB1Periph_CAN1,DISABLE);
	}
}

/*********************************************************************
 * @fn      CAN_Init
 *
 * @brief   Initializes the CAN peripheral according to the specified
 *        parameters in the CAN_InitStruct.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_InitStruct - pointer to a CAN_InitTypeDef structure that
 *        contains the configuration information for the CAN peripheral.
 *
 * @return  InitStatus - CAN InitStatus state.
*             CAN_InitStatus_Failed.
*             CAN_InitStatus_Success.
 */
uint8_t CAN_Init(CAN_TypeDef* CANx, CAN_InitTypeDef* CAN_InitStruct)
{
	uint8_t InitStatus = CAN_InitStatus_Failed;
	uint32_t wait_ack = 0x00000000;

	CANx->CTLR &= (~(uint32_t)CAN_CTLR_SLEEP);
	CANx->CTLR |= CAN_CTLR_INRQ ;

	while (((CANx->STATR & CAN_STATR_INAK) != CAN_STATR_INAK) && (wait_ack != INAK_TIMEOUT))
	{
		wait_ack++;
	}

	if ((CANx->STATR & CAN_STATR_INAK) != CAN_STATR_INAK)
	{
		InitStatus = CAN_InitStatus_Failed;
	}
	else 
	{
		if (CAN_InitStruct->CAN_TTCM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_TTCM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_TTCM;
		}

		if (CAN_InitStruct->CAN_ABOM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_ABOM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_ABOM;
		}

		if (CAN_InitStruct->CAN_AWUM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_AWUM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_AWUM;
		}

		if (CAN_InitStruct->CAN_NART == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_NART;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_NART;
		}

		if (CAN_InitStruct->CAN_RFLM == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_RFLM;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_RFLM;
		}

		if (CAN_InitStruct->CAN_TXFP == ENABLE)
		{
			CANx->CTLR |= CAN_CTLR_TXFP;
		}
		else
		{
			CANx->CTLR &= ~(uint32_t)CAN_CTLR_TXFP;
		}

		CANx->BTIMR = (uint32_t)((uint32_t)CAN_InitStruct->CAN_Mode << 30) | \
								((uint32_t)CAN_InitStruct->CAN_SJW << 24) | \
								((uint32_t)CAN_InitStruct->CAN_BS1 << 16) | \
								((uint32_t)CAN_InitStruct->CAN_BS2 << 20) | \
								((uint32_t)CAN_InitStruct->CAN_Prescaler - 1);
		CANx->CTLR &= ~(uint32_t)CAN_CTLR_INRQ;
		wait_ack = 0;

		while (((CANx->STATR & CAN_STATR_INAK) == CAN_STATR_INAK) && (wait_ack != INAK_TIMEOUT))
		{
			wait_ack++;
		}

		if ((CANx->STATR & CAN_STATR_INAK) == CAN_STATR_INAK)
		{
			InitStatus = CAN_InitStatus_Failed;
		}
		else
		{
			InitStatus = CAN_InitStatus_Success ;
		}
	}

	return InitStatus;
}

/*********************************************************************
 * @fn      CAN_FilterInit
 *
 * @brief   Initializes the CAN peripheral according to the specified
 *        parameters in the CAN_FilterInitStruct.
 *
 * @param   CAN_FilterInitStruct - pointer to a CAN_FilterInitTypeDef
 *        structure that contains the configuration information.
 *
 * @return  none
 */
void CAN_FilterInit(CAN_FilterInitTypeDef *CAN_FilterInitStruct)
{
    uint32_t filter_number_bit_pos = 0;

    filter_number_bit_pos = ((uint32_t)1) << CAN_FilterInitStruct->CAN_FilterNumber;
    CAN1->FCTLR |= FCTLR_FINIT;
    CAN1->FWR &= ~((uint32_t)filter_number_bit_pos);

    if(CAN_FilterInitStruct->CAN_FilterScale == CAN_FilterScale_16bit)
    {
        CAN1->FSCFGR &= ~(uint32_t)filter_number_bit_pos;

        CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR1 =
            ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdLow) << 16) |
            (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdLow);

        CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR2 =
            ((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdHigh) << 16) |
            (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdHigh);
    }

    if(CAN_FilterInitStruct->CAN_FilterScale == CAN_FilterScale_32bit)
    {
        CAN1->FSCFGR |= filter_number_bit_pos;

