openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_can.c
		while (((CANx->STATR & CAN_MODE_MASK) != 0) && (timeout!=0))
		{
			timeout--;
		}
		if ((CANx->STATR & CAN_MODE_MASK) != 0)
		{
			status = CAN_ModeStatus_Failed;
		}
		else
		{
			status = CAN_ModeStatus_Success;
		}
	}
	else if (CAN_OperatingMode == CAN_OperatingMode_Sleep)
	{
		CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);

		while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK) && (timeout!=0))
		{
			timeout--;
		}
		if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK)
		{
			status = CAN_ModeStatus_Failed;
		}
		else
		{
			status = CAN_ModeStatus_Success;
		}
	}
	else
	{
		status = CAN_ModeStatus_Failed;
	}

	return  (uint8_t) status;
}

/*********************************************************************
 * @fn      CAN_Sleep
 *
 * @brief   Enters the low power mode.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *
 * @return  sleepstatus -
 *            CAN_Sleep_Ok.
 *            CAN_Sleep_Failed.
 */
uint8_t CAN_Sleep(CAN_TypeDef* CANx)
{
	uint8_t sleepstatus = CAN_Sleep_Failed;

	CANx->CTLR = (((CANx->CTLR) & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);
	 
	if ((CANx->STATR & (CAN_STATR_SLAK|CAN_STATR_INAK)) == CAN_STATR_SLAK)
	{
		sleepstatus =  CAN_Sleep_Ok;
	}
	
	return (uint8_t)sleepstatus;
}

/*********************************************************************
 * @fn      CAN_WakeUp
 *
 * @brief   Wakes the CAN up.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *
 * @return  wakeupstatus -
 *            CAN_WakeUp_Ok.
 *            CAN_WakeUp_Failed.
 */
uint8_t CAN_WakeUp(CAN_TypeDef* CANx)
{
	uint32_t wait_slak = SLAK_TIMEOUT;
	uint8_t wakeupstatus = CAN_WakeUp_Failed;
		
	CANx->CTLR &= ~(uint32_t)CAN_CTLR_SLEEP;
		
	while(((CANx->STATR & CAN_STATR_SLAK) == CAN_STATR_SLAK)&&(wait_slak!=0x00))
	{
		 wait_slak--;
	}
	if((CANx->STATR & CAN_STATR_SLAK) != CAN_STATR_SLAK)
	{
		wakeupstatus = CAN_WakeUp_Ok;
	}

	return (uint8_t)wakeupstatus;
}

/*********************************************************************
 * @fn      CAN_GetLastErrorCode
 *
 * @brief   Returns the CANx's last error code (LEC).
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *
 * @return  errorcode - specifies the Error code.
 *            CAN_ErrorCode_NoErr - No Error.
 *            CAN_ErrorCode_StuffErr - Stuff Error.
 *            CAN_ErrorCode_FormErr - Form Error.
 *            CAN_ErrorCode_ACKErr - Acknowledgment Error.
 *            CAN_ErrorCode_BitRecessiveErr - Bit Recessive Error.
 *            CAN_ErrorCode_BitDominantErr - Bit Dominant Error.
 *            CAN_ErrorCode_CRCErr - CRC Error.
 *            CAN_ErrorCode_SoftwareSetErr - Software Set Error.
 */
uint8_t CAN_GetLastErrorCode(CAN_TypeDef* CANx)
{
	uint8_t errorcode=0;
	
	errorcode = (((uint8_t)CANx->ERRSR) & (uint8_t)CAN_ERRSR_LEC);
	
	return errorcode;
}

/*********************************************************************
 * @fn      CAN_GetReceiveErrorCounter
 *
 * @brief   Returns the CANx Receive Error Counter (REC).
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *         Note-   
 *         In case of an error during reception, this counter is incremented 
 *         by 1 or by 8 depending on the error condition as defined by the CAN 
 *         standard. After every successful reception, the counter is 
 *         decremented by 1 or reset to 120 if its value was higher than 128. 
 *         When the counter value exceeds 127, the CAN controller enters the 
 *         error passive state.  
 * @return  counter - CAN Receive Error Counter.
 */
uint8_t CAN_GetReceiveErrorCounter(CAN_TypeDef* CANx)
{
	uint8_t counter=0;
	 
	counter = (uint8_t)((CANx->ERRSR & CAN_ERRSR_REC)>> 24);
	
	return counter;
}

/*********************************************************************
 * @fn      CAN_GetLSBTransmitErrorCounter
 *
 * @brief   Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *
 * @return  counter - LSB of the 9-bit CAN Transmit Error Counter.
 */
uint8_t CAN_GetLSBTransmitErrorCounter(CAN_TypeDef* CANx)
{
	uint8_t counter=0;
	
	counter = (uint8_t)((CANx->ERRSR & CAN_ERRSR_TEC)>> 16);
	
	return counter;
}

/*********************************************************************
 * @fn      CAN_ITConfig
 *
 * @brief   Enables or disables the specified CANx interrupts.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_IT - specifies the CAN interrupt sources to be enabled or disabled.
 *            CAN_IT_TME.
 *            CAN_IT_FMP0.
 *            CAN_IT_FF0.
 *            CAN_IT_FOV0.
 *            CAN_IT_FMP1.
 *            CAN_IT_FF1.
 *            CAN_IT_FOV1.
 *            CAN_IT_EWG.
 *            CAN_IT_EPV.
 *            CAN_IT_LEC.
 *            CAN_IT_ERR.
 *            CAN_IT_WKU.
 *            CAN_IT_SLK.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  counter - LSB of the 9-bit CAN Transmit Error Counter.
 */
void CAN_ITConfig(CAN_TypeDef* CANx, uint32_t CAN_IT, FunctionalState NewState)
{
	if (NewState != DISABLE)
	{
		CANx->INTENR |= CAN_IT;
	}
	else
	{
		CANx->INTENR &= ~CAN_IT;
	}
}

/*********************************************************************
 * @fn      CAN_GetFlagStatus
 *
 * @brief   Checks whether the specified CAN flag is set or not.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CAN_FLAG - specifies the flag to check.
 *            CAN_FLAG_EWG.
 *            CAN_FLAG_EPV.
 *            CAN_FLAG_BOF.
 *            CAN_FLAG_RQCP0.
 *            CAN_FLAG_RQCP1.
 *            CAN_FLAG_RQCP2.
 *            CAN_FLAG_FMP1.
 *            CAN_FLAG_FF1.
 *            CAN_FLAG_FOV1.
 *            CAN_FLAG_FMP0.
 *            CAN_FLAG_FF0.
 *            CAN_FLAG_FOV0.
 *            CAN_FLAG_WKU.
 *            CAN_FLAG_SLAK.
 *            CAN_FLAG_LEC.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  FlagStatus - SET or RESET.
 */
FlagStatus CAN_GetFlagStatus(CAN_TypeDef* CANx, uint32_t CAN_FLAG)
{
	FlagStatus bitstatus = RESET;
	
